In [2]:
import pyspark
import pandas as pd
data = {'name': ['Krish', 'Sudhanshu', 'Sunny'], 'age': [31, 30, 29]}
df = pd.DataFrame(data)

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark = SparkSession.builder.appName('Practise').getOrCreate()

In [5]:
spark

In [6]:
df_pyspark = spark.read.csv("test1.csv")

In [7]:
df_pyspark  =spark.read.option("header","true").csv("test1.csv",inferSchema = True)

In [8]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [9]:
df_pyspark.show()

+---+---------+----+----------+-------+
|_c0|     name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
|  8|     NULL|  36|      NULL|   NULL|
+---+---------+----+----------+-------+

In [10]:
### Check the Schema

In [11]:
df_pyspark.printSchema()

root
 |-- _c0: integer (nullable = true)
 |-- name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: double (nullable = true)

In [12]:
# ANother way to create dataframe 

df_pyspark = spark.read.csv("test1.csv",header=True,inferSchema=True)

In [13]:
df_pyspark.show()

+---+---------+----+----------+-------+
|_c0|     name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
|  8|     NULL|  36|      NULL|   NULL|
+---+---------+----+----------+-------+

In [14]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [15]:
df_pyspark.columns

['_c0', 'name', 'age', 'Experience', 'Salary']

In [16]:
df_pyspark.head(3)

[Row(_c0=0, name='Krish', age=31, Experience=10, Salary=30000.0),
 Row(_c0=1, name='Sudhanshu', age=30, Experience=8, Salary=25000.0),
 Row(_c0=2, name='Sunny', age=29, Experience=4, Salary=20000.0)]

In [17]:
df_pyspark.select(['Name','Experience']).show()

+---------+----------+
|     Name|Experience|
+---------+----------+
|    Krish|        10|
|Sudhanshu|         8|
|    Sunny|         4|
|     Paul|         3|
|   Harsha|         1|
|  Shubham|         2|
|  Mahesh |      NULL|
|     NULL|        10|
|     NULL|      NULL|
+---------+----------+

In [18]:
df_pyspark.describe().show()

+-------+------------------+------+----------------+------------------+---------------+
|summary|               _c0|  name|             age|        Experience|         Salary|
+-------+------------------+------+----------------+------------------+---------------+
|  count|                 9|     7|               8|                 7|              8|
|   mean|               4.0|  NULL|          28.125| 5.428571428571429|        24750.0|
| stddev|2.7386127875258306|  NULL|5.02671434864337|3.8234863173611093|8224.5277762834|
|    min|                 0|Harsha|              21|                 1|        15000.0|
|    max|                 8| Sunny|              36|                10|        40000.0|
+-------+------------------+------+----------------+------------------+---------------+

In [19]:
## Adding Column In Data Frame 

### Adding
df_pyspark = df_pyspark.withColumn("Eperience After 2 year",df_pyspark['Experience']+2)

In [20]:
df_pyspark.show()

+---+---------+----+----------+-------+----------------------+
|_c0|     name| age|Experience| Salary|Eperience After 2 year|
+---+---------+----+----------+-------+----------------------+
|  0|    Krish|  31|        10|30000.0|                    12|
|  1|Sudhanshu|  30|         8|25000.0|                    10|
|  2|    Sunny|  29|         4|20000.0|                     6|
|  3|     Paul|  24|         3|20000.0|                     5|
|  4|   Harsha|  21|         1|15000.0|                     3|
|  5|  Shubham|  23|         2|18000.0|                     4|
|  6|  Mahesh |NULL|      NULL|40000.0|                  NULL|
|  7|     NULL|  31|        10|30000.0|                    12|
|  8|     NULL|  36|      NULL|   NULL|                  NULL|
+---+---------+----+----------+-------+----------------------+

In [21]:
### drop 
df_pyspark = df_pyspark.drop("Eperience After 2 year")
df_pyspark.show()

+---+---------+----+----------+-------+
|_c0|     name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
|  8|     NULL|  36|      NULL|   NULL|
+---+---------+----+----------+-------+

In [22]:
#3 Rename

df_pyspark.withColumnRenamed('Name','New Name').show()

+---+---------+----+----------+-------+
|_c0| New Name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
|  8|     NULL|  36|      NULL|   NULL|
+---+---------+----+----------+-------+

### Pyspark Handling Missing Value
- Dropping Columns 
- Dropping Rows
- Various Parameter in Dropping Functionalities
- Hadling Missing Value by Mean, Median, And Mode

In [23]:
df_pyspark.show()

+---+---------+----+----------+-------+
|_c0|     name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
|  8|     NULL|  36|      NULL|   NULL|
+---+---------+----+----------+-------+

In [24]:
# remove row where presence of Null Value                                                   
df_pyspark.na.drop().show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
|  2|    Sunny| 29|         4|20000.0|
|  3|     Paul| 24|         3|20000.0|
|  4|   Harsha| 21|         1|15000.0|
|  5|  Shubham| 23|         2|18000.0|
+---+---------+---+----------+-------+

In [25]:
## Remove ALL Value is Null At row

df_pyspark.na.drop(how = "any").show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
|  2|    Sunny| 29|         4|20000.0|
|  3|     Paul| 24|         3|20000.0|
|  4|   Harsha| 21|         1|15000.0|
|  5|  Shubham| 23|         2|18000.0|
+---+---------+---+----------+-------+

In [26]:
# Remove rows with null values if the threshold value is at least equal to the number of null values in the column
df_pyspark.na.drop(how = 'any',thresh=3).show()

+---+---------+----+----------+-------+
|_c0|     name| age|Experience| Salary|
+---+---------+----+----------+-------+
|  0|    Krish|  31|        10|30000.0|
|  1|Sudhanshu|  30|         8|25000.0|
|  2|    Sunny|  29|         4|20000.0|
|  3|     Paul|  24|         3|20000.0|
|  4|   Harsha|  21|         1|15000.0|
|  5|  Shubham|  23|         2|18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|
|  7|     NULL|  31|        10|30000.0|
+---+---------+----+----------+-------+

In [27]:
# subset is used when only Remove Null Value from perticular column

df_pyspark.na.drop(how = 'any' , subset=['Experience']).show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
|  2|    Sunny| 29|         4|20000.0|
|  3|     Paul| 24|         3|20000.0|
|  4|   Harsha| 21|         1|15000.0|
|  5|  Shubham| 23|         2|18000.0|
|  7|     NULL| 31|        10|30000.0|
+---+---------+---+----------+-------+

In [28]:
### Filling the missing value
df_pyspark.na.fill('Missing Value').show()

+---+-------------+----+----------+-------+
|_c0|         name| age|Experience| Salary|
+---+-------------+----+----------+-------+
|  0|        Krish|  31|        10|30000.0|
|  1|    Sudhanshu|  30|         8|25000.0|
|  2|        Sunny|  29|         4|20000.0|
|  3|         Paul|  24|         3|20000.0|
|  4|       Harsha|  21|         1|15000.0|
|  5|      Shubham|  23|         2|18000.0|
|  6|      Mahesh |NULL|      NULL|40000.0|
|  7|Missing Value|  31|        10|30000.0|
|  8|Missing Value|  36|      NULL|   NULL|
+---+-------------+----+----------+-------+

In [29]:
### Filling missing value of specific columns then used

df_pyspark.na.fill(1 , ['Experience','age']).show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
|  2|    Sunny| 29|         4|20000.0|
|  3|     Paul| 24|         3|20000.0|
|  4|   Harsha| 21|         1|15000.0|
|  5|  Shubham| 23|         2|18000.0|
|  6|  Mahesh |  1|         1|40000.0|
|  7|     NULL| 31|        10|30000.0|
|  8|     NULL| 36|         1|   NULL|
+---+---------+---+----------+-------+

In [30]:
# Create an imputer to replace missing values with the mean of each column
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'Experience', 'Salary'],
    outputCols=['{}_imputed'.format(c) for c in ['age', 'Experience', 'Salary']]).setStrategy("mean")  #<-- Change Mean With Median when Median Are used to replacement process

In [31]:
imputer.fit(df_pyspark).transform(df_pyspark).show()

+---+---------+----+----------+-------+-----------+------------------+--------------+
|_c0|     name| age|Experience| Salary|age_imputed|Experience_imputed|Salary_imputed|
+---+---------+----+----------+-------+-----------+------------------+--------------+
|  0|    Krish|  31|        10|30000.0|         31|                10|       30000.0|
|  1|Sudhanshu|  30|         8|25000.0|         30|                 8|       25000.0|
|  2|    Sunny|  29|         4|20000.0|         29|                 4|       20000.0|
|  3|     Paul|  24|         3|20000.0|         24|                 3|       20000.0|
|  4|   Harsha|  21|         1|15000.0|         21|                 1|       15000.0|
|  5|  Shubham|  23|         2|18000.0|         23|                 2|       18000.0|
|  6|  Mahesh |NULL|      NULL|40000.0|         28|                 5|       40000.0|
|  7|     NULL|  31|        10|30000.0|         31|                10|       30000.0|
|  8|     NULL|  36|      NULL|   NULL|         36|                 5|       24750.0|
+---+---------+----+----------+-------+-----------+------------------+--------------+

## Pyspark Data Frames
- Filter Operation
- &,|, ==
- ~

In [32]:
df_pyspark2 = df_pyspark.na.drop()

In [33]:
df_pyspark2.show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
|  2|    Sunny| 29|         4|20000.0|
|  3|     Paul| 24|         3|20000.0|
|  4|   Harsha| 21|         1|15000.0|
|  5|  Shubham| 23|         2|18000.0|
+---+---------+---+----------+-------+

In [34]:
## Salary Of the people less than or eqal to 20000
df_pyspark2.filter("Salary<=20000").show()

+---+-------+---+----------+-------+
|_c0|   name|age|Experience| Salary|
+---+-------+---+----------+-------+
|  2|  Sunny| 29|         4|20000.0|
|  3|   Paul| 24|         3|20000.0|
|  4| Harsha| 21|         1|15000.0|
|  5|Shubham| 23|         2|18000.0|
+---+-------+---+----------+-------+

In [35]:
## show Name and Age of people which Salary is less than or eqal to 20000
df_pyspark2.filter("Salary<=20000").select(['Name','age']).show()

+-------+---+
|   Name|age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
| Harsha| 21|
|Shubham| 23|
+-------+---+

In [36]:
# Filter the DataFrame to include only rows where Salary is between 18000 and 20000, 
# then select the 'Name' and 'age' columns and display the results
df_pyspark2.filter((df_pyspark2["Salary"]<=20000) & (df_pyspark2["Salary"]>= 18000)).select(['Name','age']).show()

+-------+---+
|   Name|age|
+-------+---+
|  Sunny| 29|
|   Paul| 24|
|Shubham| 23|
+-------+---+

In [37]:
# Filter the DataFrame to exclude rows where Salary is less than or equal to 20000
df_pyspark2.filter(~(df_pyspark2["Salary"]<=20000)).show()

+---+---------+---+----------+-------+
|_c0|     name|age|Experience| Salary|
+---+---------+---+----------+-------+
|  0|    Krish| 31|        10|30000.0|
|  1|Sudhanshu| 30|         8|25000.0|
+---+---------+---+----------+-------+

### GroupBy And Aggregation

In [38]:
data = [
    ("Krish", "Data Science", 10000),
    ("Krish", "IOT", 5000),
    ("Mahesh", "Big Data", 4000),
    ("Krish", "Big Data", 4000),
    ("Mahesh", "Data Science", 3000),
    ("Sudhanshu", "Data Science", 20000),
    ("Sudhanshu", "IOT", 10000),
    ("Sudhanshu", "Big Data", 5000),
    ("Sunny", "Data Science", 10000),
    ("Sunny", "Big Data", 2000)
]

# Define schema
columns = ["Name", "Departments", "Salary"]

# Create DataFrame
df = spark.createDataFrame(data, columns)

# Show DataFrame
df.show()

+---------+------------+------+
|     Name| Departments|Salary|
+---------+------------+------+
|    Krish|Data Science| 10000|
|    Krish|         IOT|  5000|
|   Mahesh|    Big Data|  4000|
|    Krish|    Big Data|  4000|
|   Mahesh|Data Science|  3000|
|Sudhanshu|Data Science| 20000|
|Sudhanshu|         IOT| 10000|
|Sudhanshu|    Big Data|  5000|
|    Sunny|Data Science| 10000|
|    Sunny|    Big Data|  2000|
+---------+------------+------+

In [40]:
df.groupBy('Name').sum().show()

+---------+-----------+
|     Name|sum(Salary)|
+---------+-----------+
|    Krish|      19000|
|   Mahesh|       7000|
|Sudhanshu|      35000|
|    Sunny|      12000|
+---------+-----------+

In [44]:
## Groupby departments which gives maximum Salary

df.groupBy("Departments").max().show()

+------------+-----------+
| Departments|max(Salary)|
+------------+-----------+
|Data Science|      20000|
|         IOT|      10000|
|    Big Data|       5000|
+------------+-----------+

In [45]:
df.groupBy('Departments').count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|Data Science|    4|
|         IOT|    2|
|    Big Data|    4|
+------------+-----+

In [50]:
df.agg({"Salary":"max"}).show()

+-----------+
|max(Salary)|
+-----------+
|      20000|
+-----------+

# Spark Mlib

In [55]:
from pyspark.sql import SparkSession

# Initialize Spark session
spark = SparkSession.builder.appName("DataFrameExample").getOrCreate()

# Data extracted from the image
data = [
    ("Krish", 31, 10, 30000),
    ("Sudhanshu", 30, 8, 25000),
    ("Sunny", 29, 4, 20000),
    ("Paul", 24, 3, 20000),
    ("Harsha", 21, 1, 15000),
    ("Shubham", 23, 2, 18000)
]

# Define schema
columns = ["Name", "Age", "Experience", "Salary"]

# Create DataFrame
training = spark.createDataFrame(data, columns)

# Show DataFrame
training.show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [57]:
from pyspark.ml.feature import VectorAssembler
featureAssembler = VectorAssembler(inputCols = ["Age","Experience"],outputCol = "Independent Feature")

In [58]:
output = featureAssembler.transform(training)
output.show()

+---------+---+----------+------+-------------------+
|     Name|Age|Experience|Salary|Independent Feature|
+---------+---+----------+------+-------------------+
|    Krish| 31|        10| 30000|        [31.0,10.0]|
|Sudhanshu| 30|         8| 25000|         [30.0,8.0]|
|    Sunny| 29|         4| 20000|         [29.0,4.0]|
|     Paul| 24|         3| 20000|         [24.0,3.0]|
|   Harsha| 21|         1| 15000|         [21.0,1.0]|
|  Shubham| 23|         2| 18000|         [23.0,2.0]|
+---------+---+----------+------+-------------------+

In [60]:
finalized_data = output.select("Independent Feature" , "Salary")
finalized_data.show()

+-------------------+------+
|Independent Feature|Salary|
+-------------------+------+
|        [31.0,10.0]| 30000|
|         [30.0,8.0]| 25000|
|         [29.0,4.0]| 20000|
|         [24.0,3.0]| 20000|
|         [21.0,1.0]| 15000|
|         [23.0,2.0]| 18000|
+-------------------+------+

In [63]:
from pyspark.ml.regression import LinearRegression 

## Train Test Split
train_data  ,test_data = finalized_data.randomSplit([0.75,0.25])
regressor = LinearRegression(featuresCol='Independent Feature' , labelCol= 'Salary')
regressor = regressor.fit(train_data)

In [64]:
regressor.coefficients

DenseVector([-102.53, 1688.6818])

In [65]:
regressor.intercept

16470.03994673731

In [66]:
pred_result = regressor.evaluate(test_data)
pred_result.predictions.show()

+-------------------+------+-----------------+
|Independent Feature|Salary|       prediction|
+-------------------+------+-----------------+
|         [30.0,8.0]| 25000|26903.59520639148|
+-------------------+------+-----------------+

In [67]:
pred_result.meanAbsoluteError , pred_result.meanSquaredError

(1903.595206391481, 3623674.709796625)